#include <stdio.h>

int main() {
    int i;  //กำหนดตัวแปร i 
    for (i = 1; i <= 10; i++) { //ใช้ for loop + continue  ค่า i เริ่มต้น 1 เงื่อนไข i <= 10 อัปเดต i++
        if (i == 6) { // ถ้า i == 6 ให้ข้าม printf 
            continue;
        }
        printf("%d ",i); //แสดงค่า i โดย 6 จะไม่แสดง เพราะเกิดจากการ continue
    }
}

            // ทั้งสามโปรแกรมใช้คำสั่ง continue เพื่อข้ามการแสดงผลเลข 6 โดยให้ผลลัพธ์เหมือนกันคือแสดงเลข 1–10 ยกเว้น 6
            // ต่างกันที่ for เพิ่มค่าตัวแปรในหัวลูป ส่วน while และ do-while ต้องเพิ่มก่อน continue 