#include <stdio.h>

int main() {
    int sum, p, x, y;
    sum = 0;
    for (x = 1, y = 1; x * y <= 15; x++, y += 2)
    {
        p = x * y;
        sum = sum + p;
        printf("%d * %d = %d\n", x, y ,p);
    }
    printf("summation of x * y = %d\n", sum);
    return 0;
}

            // โปรแกรมกำหนดค่า sum p x y 
            // โดยกำหนดให้ sum = 0
            // เมื่อนำเข้าคำสั่ง for loop 
            // x เริ่มต้นเป็น 1 
            // y เริ่มต้นเป็น 1
            // โดยเงื่อนไข คือ x * y <= 15 
            // คำนวณค่า p โดย p ในการ loop ครั้งที่หนึ่ง เท่ากับ 1 * 1 = 1
            // นำไปคิดค่า sum ได้เท่ากับ 0 + 1 = 1
            // นำไปเช็คในเงื่อนไข ในบรรทัดที่ 6 พบว่ายังไม่หลุดจากเงื่อนไข ให้ทำซ้ำอีก
            // วนซ้ำมารอบที่สอง x บวกเพิ่ม 1 , y บวกเพิ่ม 2  
            // x = 2 , y = 3 , p = 6 sum = 7 
            // นำไปเช็คในเงื่อนไข ในบรรทัดที่ 6 พบว่ายังไม่หลุดจากเงื่อนไข ให้ทำซ้ำอีก
            // วนซ้ำมารอบที่ 3  x บวกเพิ่ม 1 , y บวกเพิ่ม 2 
            // x = 3 , y = 5 , p = 15 sum = 22
            // นำไปเช็คในเงื่อนไข ในบรรทัดที่ 6 พบว่ายังไม่หลุดจากเงื่อนไข ให้ทำซ้ำอีก
            // วนซ้ำมารอบที่ 4  x บวกเพิ่ม 1 , y บวกเพิ่ม 2 
            // x = 4 , y = 7 
            // ซึ่งเงื่อนไขบอกไว้ว่า x * y <= 15 
            // แต่ 4 * 7 = 28
            //จึงทำให้หลุดจากเงื่อนไข แล้ว run โค้ดต่อไปที่บรรทัดที่ 12 